src/test/jmeter/random/send.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.9" jmeter="3.0 r1743807">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Send" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="PARAM_COUNTRY1" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY1</stringProp>
            <stringProp name="Argument.value">Australia</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY2" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY2</stringProp>
            <stringProp name="Argument.value">China</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY3" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY3</stringProp>
            <stringProp name="Argument.value">Spain</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY4" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY4</stringProp>
            <stringProp name="Argument.value">Italy</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY5" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY5</stringProp>
            <stringProp name="Argument.value">Thailand</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY6" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY6</stringProp>
            <stringProp name="Argument.value">France</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PARAM_COUNTRY7" elementType="Argument">
            <stringProp name="Argument.name">PARAM_COUNTRY7</stringProp>
            <stringProp name="Argument.value">Singapore</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DATASET_ID" elementType="Argument">
            <stringProp name="Argument.name">DATASET_ID</stringProp>
            <stringProp name="Argument.value">ZA$mF2hO41z4hHiC_3UUG3h</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SEND_KEY_AUTH" elementType="Argument">
            <stringProp name="Argument.name">SEND_KEY_AUTH</stringProp>
            <stringProp name="Argument.value">aWxIZkNLV0dVbUYxZzVhUnJZX2JmZk9TYi1LOG5aNDg4dnNVUjZzQU5TaEgxdktBWm9za0VjeXlwMnJXQTJ6dThERmJKc0xQWWxJYkRqTk5RVzBBTUE=</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="USE_BATCH" elementType="Argument">
            <stringProp name="Argument.name">USE_BATCH</stringProp>
            <stringProp name="Argument.value">true</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TARGET_RPS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_RPS</stringProp>
            <stringProp name="Argument.value">600</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">300</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Basic ${SEND_KEY_AUTH}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">60</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <longProp name="ThreadGroup.start_time">1469106779000</longProp>
        <longProp name="ThreadGroup.end_time">1469106779000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
      </ThreadGroup>
      <hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </LoopController>
        <hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If !USE_BATCH" enabled="true">
            <stringProp name="IfController.condition">${USE_BATCH} != true</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request (msg x 1)" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;}</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.domain">api.rtstatistics.com</stringProp>
              <stringProp name="HTTPSampler.protocol">https</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.path">/datasets/${DATASET_ID}/items</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
              <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
              <boolProp name="HTTPSampler.monitor">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree/>
          </hashTree>
          <IfController guiclass="IfControllerPanel" testclass="IfController" testname="If USE_BATCH" enabled="true">
            <stringProp name="IfController.condition">${USE_BATCH} == true</stringProp>
            <boolProp name="IfController.evaluateAll">false</boolProp>
          </IfController>
          <hashTree>
            <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request (msg x 5)" enabled="true">
              <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
              <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                <collectionProp name="Arguments.arguments">
                  <elementProp name="" elementType="HTTPArgument">
                    <boolProp name="HTTPArgument.always_encode">false</boolProp>
                    <stringProp name="Argument.value">[{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;},&#xd;
{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;},&#xd;
{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;},&#xd;
{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;},&#xd;
{&quot;country&quot;:&quot;${__V(PARAM_COUNTRY${__Random(1,7,)})}&quot;,&quot;userId&quot;:&quot;${__RandomString(10, 123456789XYZSLMNACFGHJ)}&quot;,&quot;sku&quot;:&quot;${__RandomString(6, ABCDEFGHJKLMNOPQRSTUVWXYZ3456789)}&quot;,&quot;quantity&quot;:${__RandomString(2, 123456789)},&quot;unitPrice&quot;:${__RandomString(4, 123456789)}, &quot;discount&quot;:0.${__RandomString(2, 0123456789)},&quot;operatorId&quot;:${__RandomString(5, 123456789)}, &quot;feedback&quot;:&quot;${__RandomString(8, goodntba )}&quot;}]</stringProp>
                    <stringProp name="Argument.metadata">=</stringProp>
                  </elementProp>
                </collectionProp>
              </elementProp>
              <stringProp name="HTTPSampler.domain">api.rtstatistics.com</stringProp>
              <stringProp name="HTTPSampler.protocol">https</stringProp>
              <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
              <stringProp name="HTTPSampler.path">/datasets/${DATASET_ID}/items</stringProp>
              <stringProp name="HTTPSampler.method">POST</stringProp>
              <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
              <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
              <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
              <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
              <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
              <boolProp name="HTTPSampler.monitor">false</boolProp>
            </HTTPSamplerProxy>
            <hashTree/>
          </hashTree>
          <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="true">
            <collectionProp name="load_profile">
              <collectionProp name="1244997903">
                <stringProp name="53">5</stringProp>
                <stringProp name="1117585919">${TARGET_RPS}</stringProp>
                <stringProp name="48687">120</stringProp>
              </collectionProp>
              <collectionProp name="2134402319">
                <stringProp name="1117585919">${TARGET_RPS}</stringProp>
                <stringProp name="1117585919">${TARGET_RPS}</stringProp>
                <stringProp name="-1798311310">${DURATION}</stringProp>
              </collectionProp>
            </collectionProp>
          </kg.apc.jmeter.timers.VariableThroughputTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ThreadsStateOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Active Threads Over Time" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.ResponseTimesOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Response Times Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.TransactionsPerSecondGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Transactions per Second" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CorrectedResultCollector guiclass="kg.apc.jmeter.vizualizers.BytesThroughputOverTimeGui" testclass="kg.apc.jmeter.vizualizers.CorrectedResultCollector" testname="jp@gc - Bytes Throughput Over Time" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
      </kg.apc.jmeter.vizualizers.CorrectedResultCollector>
      <hashTree/>
      <kg.apc.jmeter.vizualizers.CompositeResultCollector guiclass="kg.apc.jmeter.vizualizers.CompositeGraphGui" testclass="kg.apc.jmeter.vizualizers.CompositeResultCollector" testname="jp@gc - Composite Graph" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">500</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <boolProp name="include_checkbox_state">false</boolProp>
        <boolProp name="exclude_checkbox_state">false</boolProp>
        <collectionProp name="COMPOSITE_CFG">
          <collectionProp name=""/>
          <collectionProp name=""/>
        </collectionProp>
      </kg.apc.jmeter.vizualizers.CompositeResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>